taroko-batch-ecs/src/main/resources/TWMP/twmpOneWayEndpoint_request_p2.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ecs="http://ecs.tcb-bank.com.tw/ecs-ws-bus/ws/ecs">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken wsu:Id="UsernameToken-3751ea3613534127af3f4c759a8e493c">
				<wsse:Username>ecs</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">C/WiGZ0tfAQjQh6osxN9Rg==</wsse:Nonce>
				<wsu:Created>2021-10-08T01:49:32.216Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ecs:twmpOneWayEndpoint>
			<!--Optional:-->
			<Header>
				<ClientTraceID>21100801493200216HCE060</ClientTraceID>
				<SrcSystemID>HCE</SrcSystemID>
				<UserID>HCEUser001</UserID>
				<UserPwd>/ZMgGerQLY9z5nX9x6EJlIS3K2M=</UserPwd>
				<SessionID>00000</SessionID>
				<TxnID>CRSHCE06</TxnID>
				<ClientDt>2021-10-08T01:49:32.216</ClientDt>
			</Header>
			<SvcRq xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ecs:CRSHCE06SvcRq">
				<InDate>1101008</InDate>
				<InTime>014932</InTime>
				<MsgType>0302</MsgType>
				<PrsCode>TGW21</PrsCode>
				<Stan>2110081493216</Stan>
				<FiscStan/>
				<FiscTxSeqNo/>
				<TPan>3567138805442101</TPan>
				<SIR>Service Instance Reference</SIR>
				<ReasonCode>Q</ReasonCode>
			</SvcRq>
		</ecs:twmpOneWayEndpoint>
	</soapenv:Body>
</soapenv:Envelope>